out/lang/lisp/lisp.org.html
<!DOCTYPE html>
<html>
<head>
<meta charset="UTF-8">
<title>lang/lisp/lisp.org</title>
</head>
<body>
<pre>#+title: lisp

* tutorial

*** function application
    - 作爲一個相對古典的語言
      沒有隱式的 curry
      多元函數的作用是嚴格的
    - &quot;作用&quot; 是
      以 &quot;()&quot; 爲邊綴符號的
      多元函數
      邊界所包圍的值中
      有一個是特殊的 被視爲函數
      而其餘的 被視爲其參數
    - 在邊綴表達式 所界定的邊界內
      1. 參數個數不夠時
         直接報告錯誤
      2. 參數個數多出時
         也可能還有默認的處理方式
         尤其是二元函數
         尤其是具有結合性的二元函數
    - 只要注意
      在邊綴表達式 所界定的邊界內
      元素個數的不同會引起不同的處理方式就可以了
      正是邊綴表達式的使用 使得同一個函數能夠承載多種語義的
    - 或者用 apply 和 funcall
    #+begin_src lisp
    (+ 1 2)
    #+end_src

*** apply &amp; funcall
    - function as argument
    #+begin_src lisp
    (+ 1 2 3)

    ;; on named function
    (apply (function +) &apos;(1 2 3))
    (apply #&apos;+ &apos;(1 2 3))
    (apply &apos;+ &apos;(1 2 3))

    ;; funcall 是必要的
    ;; 因爲 邊綴表達式 () 的頭上的 symbol
    ;; 會被解釋爲一個函數名 而不會被當作局部變元處理
    (funcall (function +) 1 2 3)
    (funcall #&apos;+ 1 2 3)
    (funcall &apos;+ 1 2 3)

    ;; I will use (function +) always
    (sort (list 4 2 3 1) (function &lt;))

    ;; on lambda function
    (funcall #&apos;(lambda (x) (+ x 100))
             1)
    (funcall (function (lambda (x) (+ x 100)))
             1)
    (funcall (lambda (x) (+ x 100))
             1)
    (apply (lambda (x) (+ x 100))
           &apos;(1))

    ;; I will use (lambda (x) (+ x 100)) always
    (mapcar (lambda (x) (+ x 10))
            &apos;(1 2 3 4 5))
    #+end_src

*** lambda abstraction
    - λ xyz : N  =
      (lambda (x y z) N)
    #+begin_src lisp
    (lambda (a b) (+ a b))

    ((lambda (a b) (+ a b))
     1 2)


    ;; &amp;rest

    ((lambda (x1 x2 &amp;rest x333)
       (list x1 x2 x333))
     1 2 3 3 3 3 3 3)


    ;; &amp;optional

    ((lambda (x1 x2 &amp;optional x3)
       (list x1 x2 x3))
     1 2)

    ((lambda (x1 x2 &amp;optional x3)
       (list x1 x2 x3))
     1 2 9)

    ((lambda (x1 x2 &amp;optional (x3 3))
       (list x1 x2 x3))
     1 2)

    ((lambda (x1 x2 &amp;optional (x3 3))
       (list x1 x2 x3))
     1 2 9)


    ;; &amp;key

    ((lambda (x1 x2 &amp;key x3)
       (list x1 x2 x3))
     1 2 :x3 9)

    ((lambda (x1 x2 &amp;key (x3 3))
       (list x1 x2 x3))
     1 2)
    #+end_src

*** data type

***** boolean
      #+begin_src lisp
      ;; t as true
      t

      ;; nil as false
      ()
      &apos;()
      nil
      &apos;nil
      #+end_src

***** symbol
      #+begin_src lisp
      ;; case-insensitive
      (eq &apos;kkk &apos;KKK)

      ;; value name space
      (defvar *kkk* 5)
      (symbol-value &apos;*kkk*)
      (boundp &apos;*kkk*)

      (defun kkk () &apos;k)
      (symbol-function &apos;kkk)

      (list &apos;|ci ci ci|
            &apos;|ca,ca,ca|
            &apos;|(da da da)|
            &apos;|   |
            &apos;|abc|
            &apos;|ABC|
            &apos;|\|\|\||
            &apos;|\\\\\\|)


      ;; symbol-&gt;string
      ;; i.e. hash-back
      (symbol-name &apos;kkk)
      (mapcar (lambda (symbol)
                (list (symbol-name symbol)
                      (length (symbol-name symbol))))
              (list &apos;|ci ci ci|
                    &apos;|ca,ca,ca|
                    &apos;|(da da da)|
                    &apos;|   |
                    &apos;|abc|
                    &apos;|ABC|
                    &apos;|\|\|\||
                    &apos;|\\\\\\|))


      ;; 每一個 key 就等價於所有 symbol 所組成的一個新的命名空間
      ;; 不過這種全局的性質 一般只有語言的核心部分才會使用到
      ;; 否則不同的人所寫的程序就相互衝突了
      ;; 而 一般的程序都只使用一般性質的 hash-table
      (setf (get &apos;kkk &apos;color1) &apos;red
            (get &apos;kkk &apos;color2) &apos;yellow
            (get &apos;kkk &apos;color3) &apos;blue)
      (get &apos;kkk &apos;color1)
      (symbol-plist &apos;kkk)

      ;; 其實 (function symbol) 的更清晰的語義是
      ;;   (get &apos;symbol &apos;function)
      ;; 而 symbol 的更清晰的語義是
      ;;   (get &apos;symbol &apos;value)
      ;; 這兩個命名空間並沒有什麼特殊性
      ;; 尤其是當能以如此的方式爲某個命名空間提供特殊的語法時
      ;; 就能形成對多個命名空間的良好利用
      ;; 比如 package[module] 和 type

      ;; 返回兩個值
      ;; 第二個值是一個對函數運行狀態的報告
      ;; intern 以 package name 爲額外參數
      ;; 這說明不同的 package
      ;; 有不同的 hash-function 和 hash-table 邪
      (intern &quot;RANDOM-SYMBOL&quot;)
      (eq (intern &quot;RANDOM-SYMBOL&quot;)
          &apos;random-symbol)
      (eq (intern &quot;random-symbol&quot;)
          &apos;random-symbol)
      #+end_src

***** number
      #+begin_src lisp
      (expt (expt (expt (expt 10 10) 10) 10) 10)
      (+ 5/9 3/4)
      (* 2 (+ #c(10 5) 4))
      #+end_src

***** list

***** array
      - matrix
        is called array
      - one dimension matrix
        is called vector
      - 然而其實
        就實現方式而言
        高維的結構是用一維的結構實現的
        而不是相反
        這是由計算機之內存的線性的[相對線性的]尋址方式決定的
      - 此處的設計其實還是相當優良的
        common-lisp 之不好之處幾乎就只在於
        因爲 由一個成員構成複雜的委員會而領導
        所以 其某些設計決策爲了兼顧各方而混亂
      - 當然其不好之處還在於對函數的晦澀命名
        然而這幾乎是所有需要定義術語的領域的通病
        common-lisp 做的其實已經很好了
      - 其實這裏的 &apos;() 與 #()
        也都可以稱作是邊綴表達式
        只不過其形態不對稱而已
      #+begin_src lisp
      ;; 在 sbcl 中 默認的是
      (make-array &apos;(2 3) :initial-element 0)
      (make-array &apos;(2 3))


      (setf a3
            (make-array &apos;(3) :initial-element nil))
      (setf v3
            (make-array 3 :initial-element nil))
      ;; 這裏可以看 出語法設計的不規則性
      ;; 儘管這裏的 不規則性 其實是情有可原的


      (setf a23
            (make-array &apos;(2 3) :initial-element nil))

      (setf a234
            (make-array &apos;(2 3 4) :initial-element nil))



      ;; 很直觀地
      ;;   長度爲 2 的向量中 包含 長度爲 3 的向量
      ;;   長度爲 3 的向量中 包含 長度爲 4 的向量

      ;; literal array as the following
      #3a(((nil nil nil nil) (nil nil nil nil) (nil nil nil nil))
          ((nil nil nil nil) (nil nil nil nil) (nil nil nil nil)))

      (setf *print-array* t)
      #3a(((nil nil nil nil) (nil nil nil nil) (nil nil nil nil))
          ((nil nil nil nil) (nil nil nil nil) (nil nil nil nil)))

      (setf *print-array* nil)
      #3a(((nil nil nil nil) (nil nil nil nil) (nil nil nil nil))
          ((nil nil nil nil) (nil nil nil nil) (nil nil nil nil)))


      ;; aref denotes array-reference
      (aref a23 0 0)
      (setf (aref a23 0 0) 1)


      (make-array &apos;(3) :initial-element nil)
      (make-array 3 :initial-element nil)
      (vector nil nil nil)

      (vector &quot;a&quot; &apos;b 3)
      (setf v (vector &quot;a&quot; &apos;b 3))
      (aref v 0)

      (svref v 0)
      ;; svref denotes simple-vector
      ;; simple as
      ;;   not adjustable
      ;;   not displaced
      ;;   not has a fill-pointer


      (arrayp #3a(((nil nil nil nil) (nil nil nil nil) (nil nil nil nil))
                  ((nil nil nil nil) (nil nil nil nil) (nil nil nil nil))))
      (vectorp #3a(((nil nil nil nil) (nil nil nil nil) (nil nil nil nil))
                   ((nil nil nil nil) (nil nil nil nil) (nil nil nil nil))))
      #+end_src

***** char &amp; string
      - string is char-vector
      #+begin_src lisp
      (char-code #\@) ;; 64
      (code-char 64)
      (char-code #\中)
      (code-char 20013) ;; #\U4E2D

      (char&lt; #\A #\a)

      (sort &quot;elbow&quot; (function char&lt;))

      (aref &quot;abc&quot; 0)
      (char &quot;abc&quot; 0)

      ;; destructive function (setf aref)
      ;; called on constant data
      (let ((str &quot;Merlin&quot;))
        (setf (char str 3) #\k)
        str)

      (let ((str (copy-seq &quot;Merlin&quot;)))
        (setf (char str 3) #\k)
        str)

      (copy-seq #(1 2 3))

      (equal &quot;lisp&quot; &quot;lisp&quot;)
      (equal &quot;lisp&quot; &quot;LISP&quot;)

      (equalp &quot;lisp&quot; &quot;lisp&quot;)
      (equalp &quot;lisp&quot; &quot;LISP&quot;)


      (string-equal &quot;lisp&quot; &quot;LISP&quot;)

      (equal #(1) #(1))
      (equalp #(1) #(1))


      ;; nil means do not print at all
      ;; it makes format become make-string
      (format nil &quot;~A or ~A&quot; &quot;truth&quot; &quot;dare&quot;)
      (concatenate &apos;string &quot;not &quot; &quot;to worry&quot;)


      (princ &apos;(&quot;kkk&quot; &quot;kkk&quot; &quot;kkk&quot;))
      (princ &quot;he yelled \&quot;stop that thief!\&quot; from the busy street.&quot;)
      #+end_src

***** sequence
