out/lang/lisp/lisp.org.html
      - 儘管在 common-lisp 中
        並沒有一個機制來以一致的方式
        表示數學結構之間的複雜關係
        但還是嘗試使用 sequence
        來綜合 lisp 和 vector 這兩個數學結構
      - &gt;&lt;&gt;&lt;&gt;&lt;
        同樣是試圖捕捉數學結構間的關係
        以避免對處理函數的重複定義
        [正如 以避免對類似命題的重複證明]
        但是 common-lisp 與 haskell 對此的處理方式非常不同
        這種處理方式直接的差別
        以及其各自所達到的效果
        值得仔細分析
      - 另外在神語中
        key-word argument 完全可以用模式匹配來實現
      #+begin_src lisp
      (elt &apos;(a b c) 0)
      (elt #(a b c) 0)
      (elt &quot;abc&quot; 0)


      :key
      :test
      :from-end
      :start
      :end

      (position #\a &quot;fantasia&quot;)
      (position #\a &quot;fantasia&quot; :start 3 :end 5)
      (position #\a &quot;fantasia&quot; :start 5 :end nil)

      (position #\a &quot;fantasia&quot; :from-end t)

      (position &apos;a &apos;((c d) (a b)) :key (function car))
      (position &apos;a `(,(car &apos;(c d)) ,(car &apos;(a b))))
      (position &apos;a (list (car &apos;(c d)) (car &apos;(a b))))

      (position &apos;(a b) &apos;((a b) (c d)))
      (position &apos;(a b) &apos;((a b) (c d)) :test (function eql))
      (position &apos;(a b) &apos;((a b) (c d)) :test (function equal))

      (position 3 &apos;(1 0 7 5) :test (function &lt;))


      (defun second-word (string)
        (let* ((sqace (code-char 32))
               (position-after-sqace
                (+ (position sqace string) 1)))
          (subseq string position-after-sqace
                  (position sqace string
                            :start position-after-sqace))))
      (second-word &quot;Form follows function.&quot;)


      (position-if (function oddp) &apos;(2 2 2 3 3))
      (position-if (function oddp) &apos;(2 2 2))

      (find #\a &quot;cat&quot;)
      (find-if (lambda (char) (char= #\a char))
               &quot;cat&quot;)

      (find &apos;a &apos;(c a t))
      (find-if (lambda (symbol) (eq &apos;a symbol))
               &apos;(c a t))

      (member &apos;a &apos;(c a t))
      (member-if (lambda (symbol) (eq &apos;a symbol))
                 &apos;(c a t))


      (find-if (lambda (x)
                 (eql (car x) &apos;a))
               &apos;((c c) (a a) (t t)))
      (find &apos;a
            &apos;((c c) (a a) (t t))
            :key (function car))


      ;; like foldl
      (reduce (function intersection)
              &apos;((b r a d s) (b a d) (c a t)))
      (intersection (intersection &apos;(b r a d s)
                                  &apos;(b a d))
                    &apos;(c a t))
      #+end_src

***** structure
      - 這種用來定義一系列函數的函數
        在蟬語中也將常用與將某些些代碼的模式結構化
        然而
        我將設計良好的命名規則
        以讓相關的操作都變得瞭然
      #+begin_src lisp
      (defstruct point
        x
        y)


      (make-point)

      ;; make-point
      ;; point-p
      ;; copy-point
      ;; point-x
      ;; point-y

      (setf p (make-point :x 0 :y 0))

      (point-p p)
      (typep p &apos;point)

      (point-x p)
      (point-y p)
      (setf (point-y p) 2)



      (defstruct polemic
        (type (progn
                (format t &quot;What kind of polemic was it? &quot;)
                (read)))
        (effect nil))
      (setf kkk (make-polemic))

      (defstruct (point (:conc-name p)
                        ;; change &quot;point-&quot; to &quot;p&quot;
                        (:print-function print-point))
        (x 0)
        (y 0))

      (defun print-point (p stream depth)
        (format stream &quot;#&lt;~A,~A&gt;&quot; (px p) (py p)))

      (setf p (make-point :x 0 :y 0))

      (point-p p)
      (typep p &apos;point)

      (px p)
      (py p)
      (setf (py p) 2)
      #+end_src

***** hash table
      #+begin_src lisp
      (setf color-table (make-hash-table))

      ;; gethash 返回兩個值
      ;; 其中第二個值是一個 type-tag
      ;; type-tag 被用以表明這個位置的是否有值存入
      ;; nil 不能作爲信號來表明沒有值存入
      ;; 因爲 nil 本身就可能是被存入的值
      ;; &gt;&lt; 這種信號性的返回值在蟬語中應該如何設計呢
      ;; 有更好的處理方式嗎?
      ;; 如果只是使用多返回值的話 那麼在蟬語中是很簡單的
      (gethash &apos;color1 color-table)

      ;; 萬能的 setf
      (setf (gethash &apos;color1 color-table) &apos;red
            (gethash &apos;color2 color-table) &apos;yellow
            (gethash &apos;color3 color-table) &apos;blue)

      ;; remhash 的返回值 只有一個
      ;; 並且是一個信號性的值 代表需要進行 remove
      (remhash &apos;color1 color-table)

      (maphash (lambda (key value)
                 (format t &quot;~A = ~A ~%&quot; key value))
               color-table)



      ;; 注意這列的 hash-table 是一般性的
      ;;   hash-function 可以作用於的值可以是任何類型的
      ;;   而其 可以存儲的值也可以是任何類型的
      ;; 與蟬語中的並不同類

      (defun kkk (x) x)

      (setf bug-table (make-hash-table))
      (setf (gethash (function kkk) bug-table)
            &quot;kkk took my baby away&quot;)
      ;; (push &quot;kkk took my baby away&quot;
      ;;       (gethash (function kkk) bug-table))
      (gethash (function kkk) bug-table)

      ;; 重新定義之後就不被認爲是相同的值了
      (defun kkk (x) (+ x x))


      ;; 關於實現方式
      ;; 說 hash-table 的大小會在需要的時候自動增加
      ;; 難道 hash-function 能夠以漸進的方式被改寫?
      ;; 也許
      ;; 確實
      ;; 巧妙的數論函數可以完成很多讓人意想不到的任務
      ;; &gt;&lt;&gt;&lt;&gt;&lt;
      ;; 值得好好研究一下數論函數在 hash-function 中的應用

      ;; 因爲需要查找 所以又涉及到對不同的謂詞[等詞]的處理
      ;; 這又是實現上的一個難點
      (setf writers (make-hash-table :test (function equal)))
      (setf (gethash &apos;(ralph waldo emerson) writers) t)
      #+end_src

*** side effect

***** assignment
      - defvar 定义全局变量
        defparameter 定义全局变量
        并且所作的绑定不会被 defvar 修改
        let 定义局部变量
      - flet 定义局部非递归函数
        labels 定义局部递归函数
      - 注意 其二類分屬兩個命名空間
      #+begin_src lisp
      ;; global
      ;; 全局的名 是值與 symbol 的綁定
      ;; 而局部的名 的實現方式各異

      ;; setf 和 setq 是在全局和局部都通用的
      ;; 不知道他們又什麼區別

      (defparameter kkk 1)
      (boundp &apos;kkk)
      kkk
      (defvar kkk 2)
      ;; 如果 kkk 之前已經被定義過了
      ;; 那麼 defvar 不會重新綁定其值 但是也不會報錯
      kkk

      (defvar xxx 1)
      xxx
      (defvar xxx 2)
      xxx

      (setf xxx1 1)
      xxx1
      (defvar xxx1 2)
      xxx1

      (setq xxx2 1)
      xxx2
      (defvar xxx2 2)
      xxx2

      ;; 只要是對這個命名空間的綁定都是如此



      (defparameter *kkk* 10)

      (defconstant LIMIT (+ *kkk* 1))

      (boundp &apos;*kkk*)
      (boundp &apos;limit)

      (setf a &apos;b
            c &apos;d
            e &apos;f)

      ;; generalized references
      (setf x (list &apos;a &apos;b &apos;c))
      (setf (car x) &apos;k) ;; (set-car! x &apos;n)
      (setf (car (cdr x)) &apos;k)
      (setf (car (cdr (cdr x))) &apos;k)

      ;; 只要把 () 視爲一個邊綴表達式
      ;; 那麼下面的語義的實現方式就容易理解了
      (defparameter *colours* (list &apos;red &apos;green &apos;blue))
      (setf (car *colours*) &apos;yellow)
      (push &apos;red (cdr *colours*))

      ;; 但是 common-lisp 中 相關的語法還是顯得混亂
      ;; 在蟬語中 我要以一致的方式來解決這些問題


      ;; local
      (let ((x 6)
            (y 5))
        (* x y))

      (let ((x6 6)
            (y 5))
        (boundp &apos;x6))

      ;; 局部的 名 與值的綁定也是可以更改的
      (let ((x 6)
            (y 5))
        (setf x 2)
        (* x y))

      (let ((x 6)
            (y 5))
        (setq x 2)
        (* x y))

      ;; 局部的 counter 在 add-counter 內部
      (let ((counter 10))
        (defun add-counter (x)
          (prog1
              (+ counter x)
            (incf counter))))

      (setf counter 10)

      (boundp &apos;counter)

      (mapcar (function add-counter) &apos;(1 1 1 1))
      (add-counter 50)


      ;; 簡陋的模式匹配
      (destructuring-bind (w (x y) . z) &apos;(a (b c) d e)
        (list w x y z))
      #+end_src

***** io

******* read [read-sexp]
        #+begin_src lisp
        (defun ask-for-list ()
          (format t &quot; ^-^ please enter a list: &quot;)
          (let ((val (read)))
            (if (listp val)
                val
                (ask-for-list))))
        #+end_src

******* format
        #+begin_src lisp
        (defun format-names (list)
          (format nil &quot;~{~:(~a~)~#[.~; and ~:;, ~]~}&quot; list))

        (format-names &apos;(doc grumpy happy sleepy bashful
                        sneezy dopey))
        &quot;Doc, Grumpy, Happy, Sleepy, Bashful, Sneezy and Dopey.&quot;
        (format-names &apos;(fry laurie))
        &quot;Fry and Laurie.&quot;
        (format-names &apos;(bluebeard))
        &quot;Bluebeard.&quot;
        #+end_src
