lang/lisp/lisp.org
******* format & do & dolist
        - 在考慮各種語法糖的時候
          注意它們是如何引入約束變元的
          對約束變元的使用 是不同編程風格的特徵
        #+begin_src lisp
        (defun show (start end)
          (do ((i start (+ i 1)))
              ((> i end)
               (format t "~% finish ^-^"))
            (format t "~% ~A ~A ~A ~A" i (* i i) (* i i i) (* i i i i))))
        (defun show (i end)
          (if (> i end)
              'done
              (progn
                (format t "~% ~A ~A ~A ~A" i (* i i) (* i i i) (* i i i i))
                (show-squares (+ i 1) end))))
        (show 3 9)


        (defun how-long? (lst)
          (let ((len 0))
            (dolist (_ lst)
              (setf len (+ len 1)))
            len))
        (defun how-long? (lst)
          (if (null lst)
              0
              (+ (how-long? (cdr lst)) 1)))
        (how-long? '(1 2 3))
        #+end_src

******* path
        #+begin_src lisp
        (user-homedir-pathname)

        (setf *default-pathname-defaults* (user-homedir-pathname))

        (make-pathname :name "kkk~")

        ;; literal
        #P"kkk~"
        #+end_src

******* file & read & format
        - stream 作爲輸入輸出的一種抽象
        - ><><><
          輸入輸出的形式多種多樣
          仔細想來其類別相當複雜
          值得仔細分析一下
        - 最簡單的有兩種
        - 文件的讀寫
          其樣貌類似與文本編輯器的 buffer
          把文件從硬盤讀到一塊內存中
          然後修改 然後保存回硬盤
          此時在 buffer 中
          可以有[一個或多個]類似光標的指針
        - 基本輸入輸出
        #+begin_src lisp
        ;; form a (file . buffer) pair
        (setf stream (open (make-pathname :name "kkk~")
                           :direction ':output
                           :if-exists ':supersede))
        ;; edit the buffer
        (format stream "kkk took my baby away ~%")
        ;; save-buffer-to-file
        (close stream)

        (with-open-file (stream (make-pathname :name "kkk~")
                                :direction ':output
                                :if-exists ':supersede)
          (format stream "with-open-file~%")
          (format stream "kkk took my baby away~%"))


        (setf stream (open (make-pathname :name "kkk~")
                           :direction ':input))
        (read-line stream)



        ;; 在讀文件的時候也有一個類似光標的隱含的指針
        ;; 我應該把這個指針明顯化
        ;; 只不過在從命令行中讀字符時
        ;; 這個指針是不能隨便亂動的 因爲後面的字符還沒輸入呢
        (with-open-file (stream (make-pathname :name "kkk~")
                                :direction ':input)
          (list (read-line stream)
                (read-line stream)))

        (with-open-file (stream (make-pathname :name "kkk~")
                                :direction ':input)
          (list (read-line stream)
                (read-line stream)
                (read-line stream)))

        (with-open-file (stream (make-pathname :name "kkk~")
                                :direction ':input)
          (list (read-line stream nil)
                (read-line stream nil)
                (read-line stream nil)
                (read-line stream nil)))

        (with-open-file (stream (make-pathname :name "kkk~")
                                :direction ':input)
          (list (read-line stream nil 'eof)
                (read-line stream nil 'eof)
                (read-line stream nil 'eof)
                (read-line stream nil 'eof)))

        (defun read#line (&key
                            (from *standard-input*)
                            (eof-as-error? t)
                            (read-eof-as 'eof))
          (read-line from eof-as-error? read-eof-as))

        (with-open-file (stream (make-pathname :name "kkk~")
                                :direction ':input)
          (list (read#char :from stream :eof-as-error? nil)
                (read#char :from stream :eof-as-error? nil)
                (read#char :from stream :eof-as-error? nil)
                ))


        ;; 可選擇的參數都應該用 &key 來定義
        ;; 應該在省略 :key 的時候遵從默認的順序
        ;; 而不應該使用 &optional
        ;; 這是函數調用語法接口的設計失誤

        ;; read-line 又是需要返回一些信號的例子
        ;; 因此 它返回兩個值
        ;; 第一個是所讀入的字符串
        ;; 第二個
        ;;   以 nil 表 正常讀入
        ;;   以 t 表 沒有遇到 newline 字符 被讀的東西就結束了

        (defun pseudo-cat (file)
          (with-open-file (str file rdirection :input)
            (do ((line (read-line str nil 'eof)
                       (read-line str nil 'eof)))
                ((eql line 'eof))
              (format t "~A~%" line))))

        ;; read as read-sexp
        ;; 應該把用以實現 read-line 和 read-sexp 的函數暴露出來
        ;; 使用戶能夠自己定義閱讀器


        ;; 同 read 也是 read-sexp
        ;; 這種閱讀中 因爲沒有 eval
        ;; 所以 symbol 是不用加引號的
        (read-from-string "aaa bbb ccc")
        ;; 返回兩個參數
        ;; 其二是 光標的位置
        ;; 在上面的例子中
        ;; 光標在 bbb 的第一個 b
        ;; 因爲只有讀到 bbb 前面的空格時
        ;; 才能判定出一個 symbol
        ;; 並且猶豫 光標不能回退 所以就停在了 b

        ;; 在光標可以回退的時候也沒有回退
        ;; 這是爲了統一處理兩種不同類型的輸入而設計的
        ;; 但是這並不是良好的設計

        ;; 所以在使用時
        ;; 爲了靈活性 可以總是把文件讀入到字符串中來處理
        ;; 這樣 就能夠以明顯的方式實現一個或多個光標了

        ;; 另有 read-char
        ;; 而 peek-char 是 read-char 的 不移動光標的版本



        (princ "Hello")
        (prin1 "Hello")  ;; with quote
        (terpri) ;; newline
        ;; 這些函數傻逼名字就足以讓我不使用他們了
        ;; 所以只使用 format

        ;; 而 format 的設計失誤在於
        ;; 不應該用 t 和 nil 來做默認的參數
        ;;   因爲語義不清晰
        ;; 不應該用 format-string (or control-string)
        ;;   而應該用可以以更靈活的方式排版的語法
        ;;   以增加可讀性和靈活性
        #+end_src

***** dynamic scoped global variables
      *standard-input*
      *package*
      *readtable*
      *print-readably*
      *print-circle*
      #+begin_src lisp
      ;; dynamically rebinding
      ;; the built-in special variable *standard-output*
      (with-open-file (file-stream #p"kkk~"
                                   :direction :output)
        (let ((*standard-output* file-stream))
          (print "This prints to the file, not stdout."))
        (print "And this prints to stdout, not the file."))
      #+end_src

*** name

***** defun
      #+begin_src lisp
      (defun explode (string &optional (delimiter #\Space))
        (let ((pos (position delimiter string)))
          (if (null pos)
              (list string)
              (cons (subseq string 0 pos)
                    (explode (subseq string (1+ pos))
                             delimiter)))))

      (explode "foo,     bar, baz" #\,)
      (explode "foo, bar,     baz")
      #+end_src

***** two name-space
      - 'symbol is a symbol
        symbol is the value bound to symbol
        (function symbol) is the function bound to the symbol
      #+begin_src lisp
      (setf (symbol-function 'kkk)
            (lambda () 'function-name-space))
      (defun kkk ()
        'function-name-space)

      (funcall (symbol-function 'kkk))
      (funcall (function kkk))
      ;; the function bounded to a name in function-name-space
      ;; will be fetched
      ;; when the name is at the head of
      ;; the function application borderfix notation
      (kkk)


      (setf (symbol-value 'kkk)
            (lambda () 'value-name-space))
      (defparameter kkk
        (lambda () 'value-name-space))

      (funcall (symbol-value 'kkk))
      ;; the value bounded to a name in value-name-space
      ;; will be fetched
      ;; when the name is at the body of
      ;; the function application borderfix notation
      (funcall kkk)
      #+end_src

*** macro

***** [note]
      - 在蟬語中
        因爲語法解析的過程與生成代碼的過程是結合在一起的
        所以 macro 可以直接用語法解析器來實現
        所以 macro 和函數一樣 是一等公民的
        而在 lisp 中情況並非如此

