out/lang/lisp/lisp.org.html
        lisp 中對 symbol 的處理 完全可以換成是 shen 的語義
        否則這種底層的 macro 太難看了
      #+begin_src lisp
      (defmacro nil! (x)
        `(setf ,x nil))
      (nil! x1)

      ;; 返回的第二個值是信號
      (macroexpand-1 &apos;(nil! x2))
      (macroexpand-1 &apos;(kkk x))

      (nil! a1)

      ((lambda (expr)
         (apply (lambda (x) `(setf ,x nil))
                (cdr expr)))
       &apos;(nil! a2))

      ;; 不同的是
      ;; 實際上
      ;; 上面返回的鏈表 會作爲代碼被 編譯器處理
      ;; 而下面是用解釋器在處理所返回的代碼
      (eval ((lambda (expr)
               (apply (lambda (x) `(setf ,x nil))
                      (cdr expr)))
             &apos;(nil! a3)))


      (setf list &apos;(a b c))
      `(list is ,list)
      `(its elements are ,@list)
      #+end_src

***** loop
      #+begin_src lisp
      (defvar *list*
        (loop
           :for x := (random 1000)
           :repeat 10
           :collect x))

      ;; 下面的循环找出最大的偶数
      (loop
         :for elt :in *list*
         :when (evenp elt)
         :maximizing elt)


      (loop
         :for elt :in *list*
         :collect (log elt))

      (loop
         :for elt :in *list*
         :collect (log elt) :into logs
         :finally
         (return logs))

      (let ((*list* (loop
                       :for x := (random 1000)
                       :repeat 10
                       :collect x)))
       (loop
          :for elt :in *list*
          :collect (log elt) :into logs
          :finally
          (return
            (loop
               ;; 下面的(values ms ns)可以用来返回多值
               :for l :in logs
               :if (&gt; l 6) :collect l :into ms
               :else :collect l :into ns
               :finally (return (values ms ns))))))

      ;; log是自然对数:(log 2.72828)
      ;; (expt 2.72828 6)
      ;; 所以上面返回的两个列表大概是6,4开
      #+end_src

*** reader macro

***** build-in
      #+begin_src lisp
      (read-from-string &quot;(400 500 600)&quot;)
      ;; ==&gt; (400 500 600)
      ;; ==&gt; 13

      (type-of (read-from-string &quot;t&quot;))
      ;; ==&gt; BOOLEAN

      #&apos;+        ;; for functions
      (type-of #&apos;+)

      #\\ ;; for literal characters
      (type-of #\\)

      #c(4 3)    ;; for complex numbers
      (type-of #c(4 3))

      #p&quot;/path/&quot; ;; for filesystem paths
      (type-of #p&quot;/path/&quot;)
      #+end_src

***** example
      #+begin_src lisp
      (set-macro-character
       #\`
       (lambda (stream char)
         (list (quote quote)
               (read stream t nil t))))

      (set-dispatch-macro-character
       #\# #\?
       (lambda (stream charl char2)
         (list &apos;quote
               (let ((1st nil))
                 (dotimes (i (+ (read stream t nil t) 1))
                   (push i 1st))
                 (nreverse 1st)))))

      (set-macro-character
       #\[
       (lambda (stream char)
         (list &apos;quote
               (let ((1st nil))
                 (dotimes (i (+ (read stream t nil t) 1))
                   (push i 1st))
                 (nreverse 1st)))))

      ;;[10
      #?10


      (set-macro-character #\}
                           (get-macro-character #\)))

      (set-macro-character
       #\{
       (lambda (stream char)
         (read-delimited-list #\} stream t)))

      {null nil}
      #+end_src

***** json-reader
      #+begin_src lisp
