lang/lisp/lisp.org
***** json-reader
      #+begin_src lisp
      ;; (cl:defpackage #:json-reader
      ;;   (:use #:cl)
      ;;   (:export #:enable-json-syntax
      ;;            #:disable-json-syntax))

      ;; (cl:in-package #:json-reader)

      (defconstant +left-bracket+ #\[)
      (defconstant +right-bracket+ #\])
      (defconstant +left-brace+ #\{)
      (defconstant +right-brace+ #\})
      (defconstant +comma+ #\,)
      (defconstant +colon+ #\:)

      (defun transform-primitive (value)
        (if (symbolp value)
            (cond
              ((string-equal (symbol-name value) "true") t)
              ((string-equal (symbol-name value) "false") nil)
              ((string-equal (symbol-name value) "null") nil)
              (t value))
            value))

      (defun create-json-hash-table (&rest pairs)
        (let ((hash-table (make-hash-table :test #'equal)))
          (loop for (key . value) in pairs
             do (setf (gethash key hash-table) value))
          hash-table))

      (defun read-next-object (separator delimiter
                               &optional (input-stream *standard-input*))
        (flet ((peek-next-char () (peek-char t input-stream t nil t))
               (discard-next-char () (read-char input-stream t nil t)))
          (if (and delimiter (char= (peek-next-char) delimiter))
              (progn
                (discard-next-char)
                nil)
              (let* ((object (read input-stream t nil t))
                     (next-char (peek-next-char)))
                (cond
                  ((char= next-char separator) (discard-next-char))
                  ((and delimiter (char= next-char delimiter)) nil)
                  (t (error "Unexpected next char: ~S" next-char)))
                object))))

      (defun read-separator (stream char)
        (declare (ignore stream))
        (error "Separator ~S shouldn't be read alone" char))

      (defun read-delimiter (stream char)
        (declare (ignore stream))
        (error "Delimiter ~S shouldn't be read alone" char))

      (defun read-left-bracket (stream char)
        (declare (ignore char))
        (let ((*readtable* (copy-readtable)))
          (set-macro-character +comma+ 'read-separator)
          (loop
             for object = (read-next-object +comma+ +right-bracket+ stream)
             while object
             collect (transform-primitive object) into objects
             finally (return `(vector ,@objects)))))

      (defun stringify-key (key)
        (etypecase key
          (symbol (string-downcase (string key)))
          (string key)))

      (defun read-left-brace (stream char)
        (declare (ignore char))
        (let ((*readtable* (copy-readtable)))
          (set-macro-character +comma+ 'read-separator)
          (set-macro-character +colon+ 'read-separator)
          (loop
             for key = (read-next-object +colon+ +right-brace+ stream)
             while key
             for value = (read-next-object +comma+ +right-brace+ stream)
             collect `(cons ,(stringify-key key) ,(transform-primitive value)) into pairs
             finally (return `(create-json-hash-table ,@pairs)))))


      (defvar *previous-readtables* nil)

      (defmacro enable-json-syntax ()
        '(eval-when (:compile-toplevel :load-toplevel :execute)
          (push *readtable* *previous-readtables*)
          (setf *readtable* (copy-readtable))
          (set-macro-character +left-bracket+ (function read-left-bracket))
          (set-macro-character +right-bracket+ (function read-delimiter))
          (set-macro-character +left-brace+ (function read-left-brace))
          (set-macro-character +right-brace+ (function read-delimiter))))

      (defmacro disable-json-syntax ()
        '(eval-when (:compile-toplevel :load-toplevel :execute)
          (setf *readtable* (pop *previous-readtables*))))



      (enable-json-syntax)





      ;; vector-empty
      (let ((x []))
        (assert (vectorp x))
        (assert (zerop (length x))))

      ;; vector-single-element
      (let ((x [1]))
        (assert (vectorp x))
        (assert (= (length x) 1))
        (assert (= (elt x 0) 1)))

      ;; vector-true-false
      (let ((x [true, false]))
        (assert (vectorp x))
        (assert (= (length x) 2))
        (assert (eql (elt x 0) t))
        (assert (eql (elt x 1) nil)))

      ;; vector-strings
      (let ((x ["foo", "bar", "baz"]))
        (assert (vectorp x))
        (assert (= (length x) 3))
        (assert (every #'string-equal x '("foo" "bar" "baz"))))

      ;; vector-lisp-forms
      (let* ((w "blah")
             (x [ "foo", 1, (+ 3 4), w ]))
        (assert (vectorp x))
        (assert (= (length x) 4))
        (assert (every #'equalp x (list "foo" 1 7 w))))

      ;; hash-table-empty
      (let ((x {}))
        (assert (hash-table-p x))
        (assert (zerop (hash-table-count x))))

      ;; hash-table-single-entry
      (let ((x {"foo": 1}))
        (assert (hash-table-p x))
        (assert (= (hash-table-count x) 1))
        (assert (eql (gethash "foo" x) 1)))

      ;; hash-table-table-single-null-entry
      (let ((x {"foo": null}))
        (assert (hash-table-p x))
        (assert (= (hash-table-count x) 1))
        (assert (eql (gethash "foo" x) nil)))

      ;; hash-table-multiple-entries
      (let ((x {
              "foo": 1,
              "bar": 2,
              "baz": 3
              }))
        (assert (hash-table-p x))
        (assert (= (hash-table-count x) 3))
        (assert (eql (gethash "foo" x) 1))
        (assert (eql (gethash "bar" x) 2))
        (assert (eql (gethash "baz" x) 3)))

      ;; hash-table-lisp-forms
      (let* ((w "blah")
             (x {
               "foo": 1,
               "bar": (+ 3 4),
               "baz": w
               }))
        (assert (hash-table-p x))
        (assert (= (hash-table-count x) 3))
        (assert (eql (gethash "foo" x) 1))
        (assert (eql (gethash "bar" x) 7))
        (assert (eql (gethash "baz" x) w)))

      ;; hash-table-key-literals
      (let ((x { foo: 1, bar: 2 }))
        (assert (hash-table-p x))
        (assert (= (hash-table-count x) 2))
        (assert (eql (gethash "foo" x) 1))
        (assert (eql (gethash "bar" x) 2)))

      ;; vector-includes-hash-table
      (let ((x [ {  foo: 1 } ]))
        (assert (vectorp x))
        (assert (= (length x) 1))
        (let ((hash-table (elt x 0)))
          (assert (hash-table-p hash-table))
          (assert (eql (gethash "foo" hash-table) 1))))
      #+end_src

