out/lang/lisp/lisp.org.html
      ;; (cl:defpackage #:json-reader
      ;;   (:use #:cl)
      ;;   (:export #:enable-json-syntax
      ;;            #:disable-json-syntax))

      ;; (cl:in-package #:json-reader)

      (defconstant +left-bracket+ #\[)
      (defconstant +right-bracket+ #\])
      (defconstant +left-brace+ #\{)
      (defconstant +right-brace+ #\})
      (defconstant +comma+ #\,)
      (defconstant +colon+ #\:)

      (defun transform-primitive (value)
        (if (symbolp value)
            (cond
              ((string-equal (symbol-name value) &quot;true&quot;) t)
              ((string-equal (symbol-name value) &quot;false&quot;) nil)
              ((string-equal (symbol-name value) &quot;null&quot;) nil)
              (t value))
            value))

      (defun create-json-hash-table (&amp;rest pairs)
        (let ((hash-table (make-hash-table :test #&apos;equal)))
          (loop for (key . value) in pairs
             do (setf (gethash key hash-table) value))
          hash-table))

      (defun read-next-object (separator delimiter
                               &amp;optional (input-stream *standard-input*))
        (flet ((peek-next-char () (peek-char t input-stream t nil t))
               (discard-next-char () (read-char input-stream t nil t)))
          (if (and delimiter (char= (peek-next-char) delimiter))
              (progn
                (discard-next-char)
                nil)
              (let* ((object (read input-stream t nil t))
                     (next-char (peek-next-char)))
                (cond
                  ((char= next-char separator) (discard-next-char))
                  ((and delimiter (char= next-char delimiter)) nil)
                  (t (error &quot;Unexpected next char: ~S&quot; next-char)))
                object))))

      (defun read-separator (stream char)
        (declare (ignore stream))
        (error &quot;Separator ~S shouldn&apos;t be read alone&quot; char))

      (defun read-delimiter (stream char)
        (declare (ignore stream))
        (error &quot;Delimiter ~S shouldn&apos;t be read alone&quot; char))

      (defun read-left-bracket (stream char)
        (declare (ignore char))
        (let ((*readtable* (copy-readtable)))
          (set-macro-character +comma+ &apos;read-separator)
          (loop
             for object = (read-next-object +comma+ +right-bracket+ stream)
             while object
             collect (transform-primitive object) into objects
             finally (return `(vector ,@objects)))))

      (defun stringify-key (key)
        (etypecase key
          (symbol (string-downcase (string key)))
          (string key)))

      (defun read-left-brace (stream char)
        (declare (ignore char))
        (let ((*readtable* (copy-readtable)))
          (set-macro-character +comma+ &apos;read-separator)
          (set-macro-character +colon+ &apos;read-separator)
          (loop
             for key = (read-next-object +colon+ +right-brace+ stream)
             while key
             for value = (read-next-object +comma+ +right-brace+ stream)
             collect `(cons ,(stringify-key key) ,(transform-primitive value)) into pairs
             finally (return `(create-json-hash-table ,@pairs)))))


      (defvar *previous-readtables* nil)

      (defmacro enable-json-syntax ()
        &apos;(eval-when (:compile-toplevel :load-toplevel :execute)
          (push *readtable* *previous-readtables*)
          (setf *readtable* (copy-readtable))
          (set-macro-character +left-bracket+ (function read-left-bracket))
          (set-macro-character +right-bracket+ (function read-delimiter))
          (set-macro-character +left-brace+ (function read-left-brace))
          (set-macro-character +right-brace+ (function read-delimiter))))

      (defmacro disable-json-syntax ()
        &apos;(eval-when (:compile-toplevel :load-toplevel :execute)
          (setf *readtable* (pop *previous-readtables*))))



      (enable-json-syntax)





      ;; vector-empty
      (let ((x []))
        (assert (vectorp x))
        (assert (zerop (length x))))

      ;; vector-single-element
      (let ((x [1]))
        (assert (vectorp x))
        (assert (= (length x) 1))
        (assert (= (elt x 0) 1)))

      ;; vector-true-false
      (let ((x [true, false]))
        (assert (vectorp x))
        (assert (= (length x) 2))
        (assert (eql (elt x 0) t))
        (assert (eql (elt x 1) nil)))

      ;; vector-strings
      (let ((x [&quot;foo&quot;, &quot;bar&quot;, &quot;baz&quot;]))
        (assert (vectorp x))
        (assert (= (length x) 3))
        (assert (every #&apos;string-equal x &apos;(&quot;foo&quot; &quot;bar&quot; &quot;baz&quot;))))

      ;; vector-lisp-forms
      (let* ((w &quot;blah&quot;)
             (x [ &quot;foo&quot;, 1, (+ 3 4), w ]))
        (assert (vectorp x))
        (assert (= (length x) 4))
        (assert (every #&apos;equalp x (list &quot;foo&quot; 1 7 w))))

      ;; hash-table-empty
      (let ((x {}))
        (assert (hash-table-p x))
        (assert (zerop (hash-table-count x))))

      ;; hash-table-single-entry
      (let ((x {&quot;foo&quot;: 1}))
        (assert (hash-table-p x))
        (assert (= (hash-table-count x) 1))
        (assert (eql (gethash &quot;foo&quot; x) 1)))

      ;; hash-table-table-single-null-entry
      (let ((x {&quot;foo&quot;: null}))
        (assert (hash-table-p x))
        (assert (= (hash-table-count x) 1))
        (assert (eql (gethash &quot;foo&quot; x) nil)))

      ;; hash-table-multiple-entries
      (let ((x {
              &quot;foo&quot;: 1,
              &quot;bar&quot;: 2,
              &quot;baz&quot;: 3
              }))
        (assert (hash-table-p x))
        (assert (= (hash-table-count x) 3))
        (assert (eql (gethash &quot;foo&quot; x) 1))
        (assert (eql (gethash &quot;bar&quot; x) 2))
        (assert (eql (gethash &quot;baz&quot; x) 3)))

      ;; hash-table-lisp-forms
      (let* ((w &quot;blah&quot;)
             (x {
               &quot;foo&quot;: 1,
               &quot;bar&quot;: (+ 3 4),
               &quot;baz&quot;: w
               }))
        (assert (hash-table-p x))
        (assert (= (hash-table-count x) 3))
        (assert (eql (gethash &quot;foo&quot; x) 1))
        (assert (eql (gethash &quot;bar&quot; x) 7))
        (assert (eql (gethash &quot;baz&quot; x) w)))

      ;; hash-table-key-literals
      (let ((x { foo: 1, bar: 2 }))
        (assert (hash-table-p x))
        (assert (= (hash-table-count x) 2))
        (assert (eql (gethash &quot;foo&quot; x) 1))
        (assert (eql (gethash &quot;bar&quot; x) 2)))

      ;; vector-includes-hash-table
      (let ((x [ {  foo: 1 } ]))
        (assert (vectorp x))
        (assert (= (length x) 1))
        (let ((hash-table (elt x 0)))
          (assert (hash-table-p hash-table))
          (assert (eql (gethash &quot;foo&quot; hash-table) 1))))
      #+end_src
