out/lang/lisp/lisp.org.html

***** test json-reader
      #+begin_src lisp
      ;; To run these tests,
      ;;
      ;; 1. (LOAD &quot;json-reader.lisp&quot;)   ;; load json reader
      ;; 2. (LOAD &quot;test.lisp&quot;)          ;; load this file
      ;; 3. (run-tests :json-test)      ;; run the tests

      (cl:in-package #:cl-user)

      (defpackage #:json-test)

      (json-reader:enable-json-syntax)

      (defun random-number ()
        (random (expt 2 32)))

      (defun random-string ()
        (with-output-to-string (out)
          (loop repeat (random 10)
             do (format out &quot;~A &quot; (random (expt 2 32))))))

      (defun run-tests (package)
        (do-symbols (s package)
          (when (fboundp s)
            (format t &quot;~&amp;~A: ~A&quot; (symbol-name s)
                    (handler-case (progn (funcall s) t)
                      (error (c) c))))))

      (defun json-test::vector-empty ()
        (let ((x []))
          (assert (vectorp x))
          (assert (zerop (length x)))))

      (defun json-test::vector-single-element ()
        (let ((x [1]))
          (assert (vectorp x))
          (assert (= (length x) 1))
          (assert (= (elt x 0) 1))))

      (defun json-test::vector-true-false ()
        (let ((x [true, false]))
          (assert (vectorp x))
          (assert (= (length x) 2))
          (assert (eql (elt x 0) t))
          (assert (eql (elt x 1) nil))))

      (defun json-test::vector-strings ()
        (let ((x [&quot;foo&quot;, &quot;bar&quot;, &quot;baz&quot;]))
          (assert (vectorp x))
          (assert (= (length x) 3))
          (assert (every #&apos;string-equal x &apos;(&quot;foo&quot; &quot;bar&quot; &quot;baz&quot;)))))

      (defun json-test::vector-lisp-forms ()
        (let* ((w &quot;blah&quot;)
               (x [ &quot;foo&quot;, 1, (+ 3 4), w ]))
          (assert (vectorp x))
          (assert (= (length x) 4))
          (assert (every #&apos;equalp x (list &quot;foo&quot; 1 7 w)))))

      (defun json-test::hash-table-empty ()
        (let ((x {}))
          (assert (hash-table-p x))
          (assert (zerop (hash-table-count x)))))

      (defun json-test::hash-table-single-entry ()
        (let ((x {&quot;foo&quot;: 1}))
          (assert (hash-table-p x))
          (assert (= (hash-table-count x) 1))
          (assert (eql (gethash &quot;foo&quot; x) 1))))

      (defun json-test::hash-table-table-single-null-entry ()
        (let ((x {&quot;foo&quot;: null}))
          (assert (hash-table-p x))
          (assert (= (hash-table-count x) 1))
          (assert (eql (gethash &quot;foo&quot; x) nil))))

      (defun json-test::hash-table-multiple-entries ()
        (let ((x {
                   &quot;foo&quot;: 1,
                   &quot;bar&quot;: 2,
                   &quot;baz&quot;: 3
                  }))
          (assert (hash-table-p x))
          (assert (= (hash-table-count x) 3))
          (assert (eql (gethash &quot;foo&quot; x) 1))
          (assert (eql (gethash &quot;bar&quot; x) 2))
          (assert (eql (gethash &quot;baz&quot; x) 3))))

      (defun json-test::hash-table-lisp-forms ()
        (let* ((w &quot;blah&quot;)
               (x {
                    &quot;foo&quot;: 1,
                    &quot;bar&quot;: (+ 3 4),
                    &quot;baz&quot;: w
                  }))
          (assert (hash-table-p x))
          (assert (= (hash-table-count x) 3))
          (assert (eql (gethash &quot;foo&quot; x) 1))
          (assert (eql (gethash &quot;bar&quot; x) 7))
          (assert (eql (gethash &quot;baz&quot; x) w))))

      (defun json-test::hash-table-key-literals ()
        (let ((x { foo: 1, bar: 2 }))
          (assert (hash-table-p x))
          (assert (= (hash-table-count x) 2))
          (assert (eql (gethash &quot;foo&quot; x) 1))
          (assert (eql (gethash &quot;bar&quot; x) 2))))

      (defun json-test::vector-includes-hash-table ()
        (let ((x [ {  foo: 1 } ]))
          (assert (vectorp x))
          (assert (= (length x) 1))
          (let ((hash-table (elt x 0)))
            (assert (hash-table-p hash-table))
            (assert (eql (gethash &quot;foo&quot; hash-table) 1)))))

      (json-reader:disable-json-syntax)
      #+end_src

*** format
    #+begin_src lisp
    (let ((k (make-string-output-stream)))
      (format k &quot;~s&quot; 123)
      (format k &quot;~s&quot; 456)
      (format k &quot;~s&quot; 789)
      (get-output-stream-string k))


    (format t &quot;~%&quot;)

    (format t &quot;~%~&amp;&quot;)
    (format t &quot;1~&amp;&quot;)
    (format t &quot;1~|&quot;)
    #+end_src

*** eval &amp; coerce &amp; compile
    - note that
      a expression will be evaluated with no lexical context
    #+begin_src lisp
    (defun read-eval-print-loop ()
      (do ()
          (nil)
        (format t &quot;~%&gt; &quot;)
        (print (eval (read)))))

    (coerce &apos;(lambda (x) x) &apos;function)
    (coerce &apos;(lambda (x) x) &apos;list)

    (compile nil &apos;(lambda (x) (+ x 2)))
    (compile &apos;read-eval-print-loop)
    #+end_src

*** multiple values
    #+begin_src lisp
    ;; 默認返回一個值
    (+ (floor pi) 2)

    ;; 返回給某些特殊的函數作爲參數時
    ;; 會返回兩個值
    (floor pi)

    ;; 一種可能的實現方式是
    ;; 让返回值能夠[在運行時]查詢自己所处的环境
    ;; 即 是哪個函數在調用這個值
    ;; 然后再根据环境返回不同的值

    (multiple-value-bind (integral fractional)
        (floor pi)
      (+ integral fractional))



    ;; to create

    (values &apos;a nil (+ 2 4))

    ((lambda ()
       ((lambda ()
          (values 1 2)))))

    ;; default to one value
    (let ((x (values 666)))
      x)

    ((lambda (x)
       x)
     (values 666))


    (values)

    ;; default to one value
    (let ((x (values)))
      x)



    ;; to receive
    (multiple-value-bind (x y z) (values 1 2 3)
      (list x y z))
    (multiple-value-bind (x y z) (values 1)
      (list x y z))

    (multiple-value-bind (s m h) (get-decoded-time)
      (format nil &quot;~A:~A:~A&quot; h m s))



    (multiple-value-list (values 1 2 3))
    (multiple-value-call (function list) (values 1 2 3))


    (multiple-value-call (function +) (values 1 2 3))

    (apply (function +)
           (multiple-value-list (values 1 2 3)))

    (apply (function +)
           (list 1 2 3))
    #+end_src

*** type
    #+begin_src lisp
    ;; 類型是有層次的
    (typep 27 &apos;integer)
    (typep 27 &apos;real)
    (typep 27 t)

    (declaim (type fixnum *count*))
    #+end_src

*** control

***** block
      - 這些語法在進行複雜的輸入輸出時可能有用
        而在一般的計算中 我儘量使用函數範式
      #+begin_src lisp
      (progn
        &apos;&lt;body&gt;)

      ;; 可以用以在循環中非局部退出
      ;; 但是在函數範式下 用遞歸函數來實現循環時
      ;; 使用並不方便
      ;; 即 必須定義局部的遞歸函數
      ;; 尤其是當想要把內部的函數因子化之時
      (block name
        &apos;&lt;body&gt;
        ;; ...
        (return-from name &apos;value)
        ;; ...
        &apos;&lt;body&gt;
        )

      (defun ak ()
        (return-from ak 47))

      (block nil
        &apos;&lt;body&gt;
        ;; ...
        (return &apos;value)
        ;; ...
        )

      (tagbody
         (setf x 0)
       top
         (setf x (+ x 1))
         (format t &quot;~A &quot; x)
         (if (&lt; x 10) (go top)))
      #+end_src

***** named block
      #+begin_src lisp
      (block early
        &apos;aaa
        (return-from early &apos;kkk)
        &apos;bbb)
      #+end_src

***** catch &amp; throw
      #+begin_src lisp
      (defun super ()
        (catch &apos;abort
          (sub)
          (format t &quot;We&apos;ll never see this.&quot;)))

      (defun sub ()
        (throw &apos;abort 99))

      (super)
      #+end_src

***** unwind-protect
      - whenever certain actions have to be followed by
        some kind of cleanup or reset
        unwind-protect may be useful
      #+begin_src lisp
      (setf x 1)

      (catch &apos;abort
        (unwind-protect
             (throw &apos;abort 99)
          (setf x 2)))
      #+end_src

*** error handling
    - 在 sbcl 中
      打印自定義的報錯信息
      跟着是出錯類型
