lang/lisp/lisp.org
*** error handling
    - 在 sbcl 中
      打印自定義的報錯信息
      跟着是出錯類型
      然後是 restart 和 backtrace
    #+begin_src lisp
    ;; error
    (progn
      (error "Oops!")
      (format t "After the error."))

    (error "Your report uses ~A as a verb." 'status)


    ;; check-type
    (let ((x '(a b c)))
      (check-type (car x) integer "an integer")
      x)

    ;; assert
    (let ((sandwich '(ham on rye)))
      (assert (eql (car sandwich) 'chicken)
              ((car sandwich))
              "I wanted a ~A sandwich." 'chicken)
      sandwich)
    #+end_src

*** handler-case
    #+begin_src lisp
    (defun assess-condition (condition)
      (handler-case (signal condition)
        (warning () "Lots of smoke, but no fire.")
        ((or arithmetic-error control-error cell-error stream-error)
            (condition)
          (format nil "~S looks especially bad." condition))
        (serious-condition (condition)
          (format nil "~S looks serious." condition))
        (condition () "Hardly worth mentioning.")))
    ;; =>  ASSESS-CONDITION

    (assess-condition (make-condition 'stream-error :stream *terminal-io*))
    ;; =>  "#<STREAM-ERROR 12352256> looks especially bad."

    (define-condition random-condition (condition) ()
      (:report (lambda (condition stream)
                 (declare (ignore condition))
                 (princ "Yow" stream))))
    ;; =>  RANDOM-CONDITION

    (assess-condition (make-condition 'random-condition))
    ;; =>  "Hardly worth mentioning."





    (handler-case form
      (type1 (var1) . body1)
      (type2 (var2) . body2) ...)

    ;; is approximately equivalent to:

    (block #1=#:g0001
      (let ((#2=#:g0002 nil))
        (tagbody
           (handler-bind ((type1 #'(lambda (temp)
                                     (setq #1# temp)
                                     (go #3=#:g0003)))
                          (type2 #'(lambda (temp)
                                     (setq #2# temp)
                                     (go #4=#:g0004))) ...)
             (return-from #1# form))
           #3# (return-from #1# (let ((var1 #2#)) . body1))
           #4# (return-from #1# (let ((var2 #2#)) . body2)) ...)))




    (handler-case form
      (type1 (var1) . body1)
      ...
      (:no-error (varN-1 varN-2 ...) . bodyN))

    ;; is approximately equivalent to:

    (block #1=#:error-return
      (multiple-value-call #'(lambda (varN-1 varN-2 ...) . bodyN)
        (block #2=#:normal-return
          (return-from #1#
            (handler-case (return-from #2# form)
              (type1 (var1) . body1) ...)))))


    #+end_src

*** common lisp object system

***** generic function
      - the common lisp object system (clos)
        does not associate methods with classes
        but rather under generic functions
      #+begin_src lisp
      (defclass kkk ()
        (k1 k2 k3))

      (setf k (make-instance 'kkk))
      (setf (slot-value k 'k1) 1)

      (defclass kkk ()
        ((k1 :accessor k1)
         (k2 :accessor k2)
         (k3 :accessor k3)))

      (setf k (make-instance 'kkk))
      (setf (k1 k) 1)
      (setf (k2 k) 2)
      (setf (k3 k) 3)


      (defclass aaa ()
        ((a1 :accessor a1)
         (a2 :accessor a2)
         (a3 :accessor a3)))

      (defmethod kkk (&key
                        x1
                        x2)
        `(,x1 ,x2))
      (kkk :x1 1 :x2 2)

      (defmethod kkk (&key
                        x1
                        (x2 aaa))
        ;; {var | ({var | (keywordvar)} [initform [supplied-p-parameter] ])}
        `(,x1 (,x2 aaa)))
      (kkk (make-instance 'kkk)
           (make-instance 'aaa))
      ;; 如果新定義了下面的函數
      ;; 那麼對上面的函數的調用結果就改變了
      (defmethod kkk ((x1 kkk) x2)
        `((,x1 kkk) ,x2))



      (defgeneric key-input (key-name))

      (defmethod key-input (key-name)
        (format nil "No keybinding for ~a" key-name))
      (key-input 1)

      (defmethod key-input ((key-name (eql :space)))
        (format nil "Space key pressed"))
      (key-input :space)

      (defmethod key-input ((key-name (eql :return)))
        (format nil "Return key pressed"))
      (key-input :return)

      (function  key-input)
      #+end_src

*** package

    - 所有的函數都在某個 package 中
      就算核心函數也不例外
    - always be in the package that you are developing
    - in-package 是就某個文件而言的
      在一個文件中對 in-package 的調用並不影響之後被 load 的文件
    #+begin_src lisp
    *package*

    (intern "ARBITRARY"
            (make-package :foo
                          :use '(:cl)))


    ;; lisp maintains a special variable called *package*
    ;; which is bound to the current package

    (in-package :cl)
    (defvar xxx 'x)
    (in-package :foo)


    (package-name *package*)
    (package-name :foo)

    (find-package :foo)
    (find-package *package*)
    (find-package "FOO")

    (symbol-package 'sym)

    ;; 原來 :kkk 是 keyword:kkk 的縮寫
    ;; 語義上有特殊性質的東西
    ;; 又發現它可以被劃歸到某種一致的處理方式中
    ;; 就涉及到一些設計決策了
    ;; 可是這裏的 :kkk 用特殊的處理方式處理的話
    ;; 也將是合理的
    #+end_src

* the art of the metaobject protocol

*** [note]

    - x -
      oo 中重要的是 易於更改
      即 當需要添加某些東西時
      不必更改很多地方

*** 1 how clos is implemented

***** intro

      - to progressively design and implement a metaobject protocol,
        motivating each step with an example
        of the kind of problem users have with CLOS.
        Each example will be resolved by showing
        how it is handled by the newly developed portion of the protocol.

      - metaobject protocol means
        to implement an interpreter of CLOS in CLOS
        called Closette.

        simplify CLOS to Closette by
        1. interpreter rather than compiler
        2. neglecting performance
        3. ommit error-checking

      - Although understanding implementation architecture is important,
        it is vital to distinguish the implementation
        from the documented language.

      - theatre metaphor :
        | documented language | on-stage  |
        | implementation      | backstage |
        | implementor         | producer  |

***** syntax example

      #+begin_src lisp
      (defclass rectangle ()
        ((height :initform 0.0 :initarg :height)
         (width  :initform 0.0 :initarg :width)))

      (defclass color-mixin ()
        ((cyan    :initform 0 :initarg :cyan)
         (magenta :initform 0 :initarg :magenta)
         (yellow  :initform 0 :initarg :yellow)))

      (defclass color-rectangle (color-mixin rectangle)
        ((clearp :initform nil
                 :initarg :clearp
                 :accessor clearp)))

      (defgeneric paint (x))

      (defmethod paint ((x rectangle))
        (vertical-stroke (slot-value x 'height)(slot-value x 'width)))

      (defmethod paint
          :before ((x color-mixin))
        (set-brush-color (slot-value x 'cyan)
                         (slot-value x 'magenta)
                         (slot-value x 'yellow)))

      (defmethod paint ((x color-rectangle))
        (unless (clearp x) (call-next-method)))

      (setq door
            (make-instance
             'color-rectangle
             :width 38 :height 84
             :cyan 60 :yellow 55
             :clearp nil))
      #+end_src

***** semantic

      - directed graph

