lang/lisp/lisp.org
***** Utilities

      #+begin_src lisp
      ;;; push-on-end is like push except it uses the other end:

      (defmacro push-on-end (value location)
        `(setf ,location (nconc ,location (list ,value))))

      ;;; (setf getf*) is like (setf getf) except that it always changes the list,
      ;;;              which must be non-nil.

      (defun (setf getf*) (new-value plist key)
        (block body
          (do ((x plist (cddr x)))
              ((null x))
            (when (eq (car x) key)
              (setf (car (cdr x)) new-value)
              (return-from body new-value)))
          (push-on-end key plist)
          (push-on-end new-value plist)
          new-value))

      ;;; mapappend is like mapcar except that the results are appended together:

      (defun mapappend (fun &rest args)
        (if (some #'null args)
            ()
            (append (apply fun (mapcar #'car args))
                    (apply #'mapappend fun (mapcar #'cdr args)))))

      ;;; mapplist is mapcar for property lists:

      (defun mapplist (fun x)
        (if (null x)
            ()
            (cons (funcall fun (car x) (cadr x))
                  (mapplist fun (cddr x)))))
      #+end_src

***** How classes are represented

      - object can be anonymous
        class is [meta] object.
        thus, class can be anonymous.

      - directed graph of subclass relation
        is implemented by one class stores
        - direct-superclasses
        - direct-subclasses

        both are list of class objects
        insteaded of class names.

      - class-precedence-list
        can be generated by direct-superclasses
        but it is also stored in class as cache.

***** How objects are printed

***** How instances are represented, initialized, and accessed

***** How generic functions are represented

***** How methods are represented

***** What happens when a generic function is called

*** 2 introspection and analysis

*** 3 extending the language

*** 4 protocol design

*** 5 a metaobject protocol for clos

*** 6 generic functions and methods

*** a an introduction to the common lisp object system

***** example

      #+begin_src lisp
      (defclass rectangle ()
        ((height
          :initform 5)
         (width
          :initform 8)))

      (defclass circle ()
        ((radius
          :initform 5)))

      (setf rl (make-instance 'rectangle))

      (defgeneric paint (shape medium))

      (defmethod paint ((shape rectangle) medium)
        (vertical-stroke (slot-value shape 'height)
                         (slot-value shape 'width)
                         medium))

      (defmethod paint ((shape circle) medium)
        (draw-circle (slot-value shape 'radius) medium))
      #+end_src

***** a.5 structure encapsulation

      - use :accessor instead of slot-value
        because this allows these generic functions to be specialized,
        for example, replacing direct access by a computation,
        without requiring anychange to client code.

        - x -
          這就使得消息傳遞語法簡化函數名的功能失去意義了
          一個 accessor 作爲函數只有一個參數那就是這個 class 的 object
          進一步 specialize 這個函數根本沒有必要

* object-oriented programming in common lisp: a programmer's guide to clos

*** 1 Introduction to the CLOS Model

*** 2 Elements of CLOS Programs

*** 3 Developing a Simple CLOS Program: Locks

*** 4 Programming with Methods

*** 5 Controlling the Generic Dispatch

*** 6 Class Inheritance

*** 7 Defining CLOS Elements

*** 8 Redefining CLOS Elements

*** 9 Creating and Initializing Instances

*** 10 A Procedural Definition: Initialization

*** 11 Developing an Advanced CLOS Program: Streams

*** 12 Highlights of CLOS
